/*самое важное в JS что нужно понять это :
-Выражения
-Функции
-Объекты

и все сущности в ЖС это объекты или ведут себя как объекты
*/

//пример объекта
{
    visible: true,
    colorDepth: 24,
    title: 'My Page',
    orientation: { //вложенный объект
        angle: 0,
        type: 'landscape'
    },
}
// Массив - это объект, функция - это объект, как и число* и строка*
// Но числа и строки ведут лишь себя как объекты (но это примитивные занчения)


// console.log('')
console //- объект
log // -метод
console.log('Daniil')
/* это выражение а любое выражение всегда возвращает значение как и функция
 пример выражений:
-'abc'
- 10
- 5 + 2
-c = 10
- 'Good' + 'Evening'
- a <= b || c !== d
-myFunction(c, d) {

};

= ( Выражение присваивания )
Выражения с побочкой:
- a = 5
- b++
- myFn(a, b)
/*/

/* 6 примитивных типов : 
1) string (строка)
2) Boolean (логический)
3) number (число)
4) null
5) undefined
6) Symbol( символ)
*/
 
// ссылочный тип один - объект